[
  {
    "id": 1,
    "title": "Réaliser",
    "category": "Compétence BUT",
    "icon": "🔧",
    "description": "Concevoir, coder, tester et intégrer une solution informatique pour un client.",
    "skills": [
      { "name": "Architecture applicative (Design Patterns)", "level": 85 },
      { "name": "Développement mobile (Flutter/Dart)", "level": 80 },
      { "name": "Qualité logicielle (TDD, tests automatisés)", "level": 85 },
      { "name": "Frameworks web (Vue.js, React, Angular)", "level": 90 },
      { "name": "APIs REST", "level": 90 }
    ],
    "progression": [
      { "period": "BUT 1", "level": "Niveau 1", "description": "Développer des applications informatiques simples. Apprentissage des bases du développement web avec HTML/CSS/JavaScript." },
      { "period": "BUT 2", "level": "Niveau 2", "description": "Partir des exigences et aller jusqu'à une application complète. Projets avec frameworks (Outfitter's en Svelte, messagerie en PHP)." },
      { "period": "BUT 3", "level": "Niveau 3", "description": "Adapter des applications sur un ensemble de supports. Maîtrise des architectures distribuées et du développement mobile (Easy Loc)." }
    ],
    "details": "Cette compétence couvre l'ensemble du cycle de développement d'une application informatique. J'ai progressé de la création d'applications simples vers des architectures complexes et distribuées, en passant par l'apprentissage des bonnes pratiques de développement et des méthodologies de test."
  },
  {
    "id": 2,
    "title": "Optimiser",
    "category": "Compétence BUT",
    "icon": "⚡",
    "description": "Proposer des applications informatiques optimisées en fonction de critères spécifiques.",
    "skills": [
      { "name": "Algorithmique avancée et structures de données", "level": 85 },
      { "name": "Analyse de complexité", "level": 80 },
      { "name": "Programmation asynchrone et concurrente", "level": 85 },
      { "name": "Optimisation des performances", "level": 80 },
      { "name": "Gestion mémoire", "level": 75 }
    ],
    "progression": [
      { "period": "BUT 1", "level": "Niveau 1", "description": "Appréhender et construire des algorithmes. Découverte des structures de données fondamentales et de la complexité algorithmique." },
      { "period": "BUT 2", "level": "Niveau 2", "description": "Sélectionner les algorithmes appropriés. Application dans les projets (Outfitter's, Easy Loc) avec optimisation des requêtes bases de données." },
      { "period": "BUT 3", "level": "Niveau 3", "description": "Analyser et optimiser des applications. Mise en place de solutions performantes dans des projets complexes (Architecture Distribuée)." }
    ],
    "details": "L'optimisation est au cœur de mes préoccupations lors du développement. J'ai appris à analyser la complexité des algorithmes, à choisir les structures de données appropriées et à optimiser les performances des applications que je développe."
  },
  {
    "id": 3,
    "title": "Administrer",
    "category": "Compétence BUT",
    "icon": "🖥️",
    "description": "Installer, configurer, mettre à disposition, maintenir en conditions opérationnelles des infrastructures.",
    "skills": [
      { "name": "Administration système Linux/Windows", "level": 85 },
      { "name": "Virtualisation et Conteneurisation (Docker)", "level": 85 },
      { "name": "Services réseaux de base", "level": 80 },
      { "name": "Sécurité des systèmes", "level": 75 },
      { "name": "Déploiement d'applications", "level": 85 }
    ],
    "progression": [
      { "period": "BUT 1", "level": "Niveau 1", "description": "Installer et configurer un poste de travail. Découverte de Linux (Ubuntu) et des commandes de base. Configuration d'environnements de développement." },
      { "period": "BUT 2", "level": "Niveau 2", "description": "Déployer des services sur un réseau local. Introduction à Docker et aux services réseaux. Administration système plus poussée." },
      { "period": "BUT 3", "level": "Niveau 3", "description": "Concevoir des solutions d'infrastructure distribuées. Déploiement d'applications en production avec Docker. Gestion de proxies et analyses réseau." }
    ],
    "details": "J'ai développé une expertise complète en administration système et infrastructure. De la configuration de postes de travail à la gestion d'infrastructures distribuées, en passant par la conteneurisation et le déploiement d'applications."
  },
  {
    "id": 4,
    "title": "Gérer",
    "category": "Compétence BUT",
    "icon": "🗄️",
    "description": "Concevoir, gérer, administrer et exploiter les données de l'entreprise.",
    "skills": [
      { "name": "Modélisation (MCD/MLD)", "level": 90 },
      { "name": "SQL avancé et NoSQL", "level": 85 },
      { "name": "Intégrité et sécurité des données", "level": 85 },
      { "name": "Administration de bases de données", "level": 85 },
      { "name": "Big Data et analyse", "level": 75 }
    ],
    "progression": [
      { "period": "BUT 1", "level": "Niveau 1", "description": "Concevoir et mettre en place une base de données. Apprentissage du SQL et de la modélisation de données. Premiers schémas relationnels." },
      { "period": "BUT 2", "level": "Niveau 2", "description": "Optimiser une base de données. Conception de bases complexes pour les projets (Outfitter's, Easy Loc). Requêtes avancées et optimisation." },
      { "period": "BUT 3", "level": "Niveau 3", "description": "Administrer et exploiter des données complexes. Administration PostgreSQL en production. Gestion de l'intégrité et de la sécurité des données." }
    ],
    "details": "La gestion des données est centrale dans tous mes projets. J'ai évolué de la conception de bases simples vers l'administration de systèmes complexes, en intégrant les aspects de sécurité, performance et intégrité des données."
  },
  {
    "id": 5,
    "title": "Conduire",
    "category": "Compétence BUT",
    "icon": "📋",
    "description": "Satisfaire les besoins des utilisateurs au regard de la chaîne de valeur du client.",
    "skills": [
      { "name": "Analyse des besoins", "level": 85 },
      { "name": "Planification et suivi de projet (Agile/Scrum)", "level": 85 },
      { "name": "Gestion de versions (Git)", "level": 90 },
      { "name": "UX/UI Design", "level": 80 },
      { "name": "Gestion de la qualité", "level": 80 }
    ],
    "progression": [
      { "period": "BUT 1", "level": "Niveau 1", "description": "Identifier les besoins métiers des clients et des utilisateurs. Introduction à Git et aux méthodologies de projet. Premiers projets collaboratifs." },
      { "period": "BUT 2", "level": "Niveau 2", "description": "Appliquer une démarche de suivi de projet. Gestion de projets en équipe (Outfitter's, Easy Loc). Méthodologies agiles et documentation." },
      { "period": "BUT 3", "level": "Niveau 3", "description": "Organiser la livraison d'un projet. Gestion complète de projets en autonomie. De l'analyse du besoin au déploiement et à la maintenance." }
    ],
    "details": "La conduite de projet est devenue une de mes forces principales. J'ai appris à analyser les besoins clients, à planifier et suivre des projets complexes, en utilisant les méthodologies agiles et les outils de gestion de versions."
  },
  {
    "id": 6,
    "title": "Collaborer",
    "category": "Compétence BUT",
    "icon": "🤝",
    "description": "Acquérir, développer et exploiter les aptitudes nécessaires pour travailler efficacement dans une équipe informatique.",
    "skills": [
      { "name": "Méthodes Agiles", "level": 85 },
      { "name": "Communication professionnelle", "level": 85 },
      { "name": "Travail en équipe", "level": 90 },
      { "name": "Gestion des conflits", "level": 75 },
      { "name": "Leadership technique", "level": 80 }
    ],
    "progression": [
      { "period": "BUT 1", "level": "Niveau 1", "description": "Identifier ses aptitudes pour travailler dans une équipe. Découverte du travail collaboratif et des premiers outils de communication en équipe." },
      { "period": "BUT 2", "level": "Niveau 2", "description": "Situer son rôle et ses missions au sein d'une équipe. Projets en groupe structurés (Outfitter's, Easy Loc) avec répartition des rôles et responsabilités." },
      { "period": "BUT 3", "level": "Niveau 3", "description": "Manager une équipe informatique. Prise de responsabilités dans les projets. Coordination d'équipes et animation de réunions techniques." }
    ],
    "details": "La collaboration est essentielle dans tous les projets informatiques. J'ai développé mes compétences relationnelles et de leadership, apprenant à travailler efficacement en équipe et à coordonner des projets collaboratifs complexes."
  }
]
